---
kind: other
id: Methods.T:Autodesk.Revit.DB.CylindricalSurface
source: html/2b51b157-bd55-8d3d-6e34-ba87a7aefe35.htm
---
# CylindricalSurface Methods

Construct a cylindrical surface defined by a local coordinate system and a radius.